In [1]:
import pandas as pd

In [35]:
baby_names = pd.read_csv('./names/yob2021.txt', names=['Name', 'Gender', 'Count'])

In [36]:
baby_names

            Name Gender  Count
0         Olivia      F  17728
1           Emma      F  15433
2      Charlotte      F  13285
3         Amelia      F  12952
4            Ava      F  12759
...          ...    ...    ...
31532     Zyeire      M      5
31533       Zyel      M      5
31534      Zyian      M      5
31535      Zylar      M      5
31536        Zyn      M      5

[31537 rows x 3 columns]

In [6]:
baby_names.head(10)

        Name Gender  Count
0     Olivia      F  17728
1       Emma      F  15433
2  Charlotte      F  13285
3     Amelia      F  12952
4        Ava      F  12759
5     Sophia      F  12496
6   Isabella      F  11201
7        Mia      F  11096
8     Evelyn      F   9434
9     Harper      F   8388

In [7]:
baby_names.shape

(31537, 3)

In [11]:
baby_names['Count'].sum()

3361375

In [13]:
baby_names.groupby('Gender').sum()

          Count
Gender
F       1627098
M       1734277

In [16]:
(baby_names['Name'] == 'Selva').sum()

0

In [17]:
(baby_names['Name'] == 'Selva').value_counts()

False    31537
Name: Name, dtype: int64

In [18]:
baby_names.loc[baby_names['Name'] == 'Selva']

Empty DataFrame
Columns: [Name, Gender, Count]
Index: []

In [23]:
Sum=baby_names['Count'].sum()
group_count=baby_names.groupby('Gender').sum()
Percentage=group_count/Sum * 100 
Percentage.round()

        Count
Gender
F        48.0
M        52.0

In [34]:
boys = baby_names.loc[baby_names['Gender'] == 'M']
girls = baby_names.loc[baby_names['Gender'] == 'F']
boys = boys.sort_values(by='Count', ascending=False).head(5)
girls = girls.sort_values(by='Count', ascending=False).head(5)
pd.concat([boys, girls]).to_excel('./top_names.xlsx')